Autodesk.Revit.DB.ExtensibleStorage.Entity.Clear(System.String)
Resets the field to its default value.
Remarks:
The default value is zero for numeric fields, invalid value for identifiers and
entities, and empty for strings and containers.
This method is a shortcut that will look up the field by name. If you want to call it
on many entities, it is faster if you look up the field  yourself.
fieldName:
The name of the field to clear.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The name matches no field in this Entity's Schema.
-or-
This field's subschema prevents writing.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This Entity is invalid.
Since:
2012

Autodesk.Revit.DB.ExtensibleStorage.Entity.Clear(Autodesk.Revit.DB.ExtensibleStorage.Field)
Resets the field to its default value.
Remarks:
The default value is zero for numeric fields, invalid value for identifiers and
entities, and empty for strings and containers.
field:
The field to clear.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The Field belongs to a different Schema from this Entity, or this Entity is invalid.
-or-
This field's subschema prevents writing.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.ExtensibleStorage.Entity.RecognizedField(Autodesk.Revit.DB.ExtensibleStorage.Field)
Checks whether a Field belongs to the same Schema as this Entity.
field:
The Field to check.
Returns:
True if the Field belongs to the same Schema as this Entity.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.ExtensibleStorage.Entity.Set``1(System.String,``0,Autodesk.Revit.DB.ForgeTypeId)
Stores the value of the field in the entity.
Remarks:
The template parameter must match the type of the field (specified when creating the
Schema) exactly; this method does not perform data type conversions. The types for containers are
IList for arrays and
IDictionary for maps.
This method only modifies your copy of the Entity. Store the Entity in an element or
another Entity to save the new value. Write access check is not performed on each call
to Set. Instead, write access is checked when you try to save the Entity in an Element
or another Entity.
This method is a shortcut that will look up the field by name. If you want to call it
on many entities, it is faster if you look up the field  yourself.
fieldName:
The name of the field to update.
unitTypeId:
Identifier of the unit from which the value will be converted before storing. Must be compatible with the spec
specified when creating the Schema.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The Field belongs to a different Schema from this Entity, or this Entity is invalid.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Requested type does not match the field type.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The name matches no field in this Entity's Schema.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The unitTypeId value is not compatible with the field description.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This field's subschema prevents writing.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Invalid floating-point value.
Since:
2012
The type of the field

Autodesk.Revit.DB.ExtensibleStorage.Entity.Set``1(Autodesk.Revit.DB.ExtensibleStorage.Field,``0,Autodesk.Revit.DB.ForgeTypeId)
Stores the value of the field in the entity.
Remarks:
The template parameter must match the type of the field (specified when creating the
Schema) exactly; this method does not perform data type conversions. The types for containers are
IList for arrays and
IDictionary for maps.
This method only modifies your copy of the Entity. Store the Entity in an element or
another Entity to save the new value. Write access check is not performed on each call
to Set. Instead, write access is checked when you try to save the Entity in an Element
or another Entity.
field:
The field to update.
unitTypeId:
Identifier of the unit from which the value will be converted before storing. Must be compatible with the spec
specified when creating the Schema.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The Field belongs to a different Schema from this Entity, or this Entity is invalid.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Requested type does not match the field type.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The unitTypeId value is not compatible with the field description.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This field's subschema prevents writing.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Invalid floating-point value.
Since:
2012
The type of the field

Autodesk.Revit.DB.ExtensibleStorage.Entity.Set``1(System.String,``0)
Stores the value of the field in the entity.
Remarks:
The template parameter must match the type of the field (specified when creating the
Schema) exactly; this method does not perform data type conversions. The types for containers are
IList for arrays and
IDictionary for maps.
Note that when string values are specified as map keys,
they are case-insensitive.
This method only modifies your copy of the Entity. Store the Entity in an element or
another Entity to save the new value. Write access check is not performed on each call
to Set. Instead, write access is checked when you try to save the Entity in an Element
or another Entity.
This method is a shortcut that will look up the field by name. If you want to call it
on many entities, it is faster if you look up the field  yourself.
fieldName:
The name of the field to update.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The Field belongs to a different Schema from this Entity, or this Entity is invalid.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Requested type does not match the field type.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The name matches no field in this Entity's Schema.
Throws Autodesk.Revit.Exceptions.ArgumentException:
For floating-point fields, use the overload taking a ForgeTypeId parameter.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This field's subschema prevents writing.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Invalid floating-point value.
Throws Autodesk.Revit.Exceptions.ArgumentException:
String is too long; exceeds max length of 16mb characters.
Since:
2012
The type of the field

Autodesk.Revit.DB.ExtensibleStorage.Entity.Set``1(Autodesk.Revit.DB.ExtensibleStorage.Field,``0)
Stores the value of the field in the entity.
Remarks:
The template parameter must match the type of the field (specified when creating the
Schema) exactly; this method does not perform data type conversions. The types for containers are
IList for arrays and
IDictionary for maps.
Note that when string values are specified as map keys,
they are case-insensitive.
This method only modifies your copy of the Entity. Store the Entity in an element or
another Entity to save the new value. Write access check is not performed on each call
to Set. Instead, write access is checked when you try to save the Entity in an Element
or another Entity.
field:
The field to update.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The Field belongs to a different Schema from this Entity, or this Entity is invalid.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Requested type does not match the field type.
Throws Autodesk.Revit.Exceptions.ArgumentException:
For floating-point fields, use the overload taking a ForgeTypeId parameter.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This field's subschema prevents writing.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Invalid floating-point value.
Throws Autodesk.Revit.Exceptions.ArgumentException:
String is too long; exceeds max length of 16mb characters.
Since:
2012
The type of the field

Autodesk.Revit.DB.ExtensibleStorage.Entity.Get``1(System.String,Autodesk.Revit.DB.ForgeTypeId)
Retrieves the value of the field in the entity.
Remarks:
The template parameter must match the type of the field (specified when creating the
Schema) exactly; this method does not perform data type conversions. The types for containers are
IList for arrays and
IDictionary for maps.
This method is a shortcut that will look up the field by name. If you want to call it
on many entities, it is faster if you look up the field  yourself.
fieldName:
The name of the field to retrieve.
unitTypeId:
Identifier of the unit to which the value will be converted before returning. Must be compatible with the spec
specified when creating the Schema.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The Field belongs to a different Schema from this Entity, or this Entity is invalid.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Requested type does not match the field type.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The name matches no field in this Entity's Schema.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The unitTypeId value is not compatible with the field description.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This field's subschema prevents reading.
Since:
2012
The type of the field

Autodesk.Revit.DB.ExtensibleStorage.Entity.Get``1(Autodesk.Revit.DB.ExtensibleStorage.Field,Autodesk.Revit.DB.ForgeTypeId)
Retrieves the value of the field in the entity.
Remarks:
The template parameter must match the type of the field (specified when creating the
Schema) exactly; this method does not perform data type conversions. The types for containers are
IList for arrays and
IDictionary for maps.
field:
The field to retrieve.
unitTypeId:
Identifier of the unit to which the value will be converted before returning. Must be compatible with the spec
specified when creating the Schema.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The Field belongs to a different Schema from this Entity, or this Entity is invalid.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Requested type does not match the field type.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The unitTypeId value is not compatible with the field description.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This field's subschema prevents reading.
Since:
2012
The type of the field

Autodesk.Revit.DB.ExtensibleStorage.Entity.Get``1(System.String)
Retrieves the value of the field in the entity.
Remarks:
The template parameter must match the type of the field (specified when creating the
Schema) exactly; this method does not perform data type conversions. The types for containers are
IList for arrays and
IDictionary for maps.
This method is a shortcut that will look up the field by name. If you want to call it
on many entities, it is faster if you look up the field  yourself.
fieldName:
The name of the field to retrieve.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The Field belongs to a different Schema from this Entity, or this Entity is invalid.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Requested type does not match the field type.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The name matches no field in this Entity's Schema.
Throws Autodesk.Revit.Exceptions.ArgumentException:
For floating-point fields, use the overload taking a ForgeTypeId parameter.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This field's subschema prevents reading.
Since:
2012
The type of the field

Autodesk.Revit.DB.ExtensibleStorage.Entity.Get``1(Autodesk.Revit.DB.ExtensibleStorage.Field)
Retrieves the value of the field in the entity.
Remarks:
The template parameter must match the type of the field (specified when creating the
Schema) exactly; this method does not perform data type conversions. The types for containers are
IList for arrays and
IDictionary for maps.
field:
The field to retrieve.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The Field belongs to a different Schema from this Entity, or this Entity is invalid.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Requested type does not match the field type.
Throws Autodesk.Revit.Exceptions.ArgumentException:
For floating-point fields, use the overload taking a ForgeTypeId parameter.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This field's subschema prevents reading.
Since:
2012
The type of the field

Autodesk.Revit.DB.ExtensibleStorage.Entity.#ctor(Autodesk.Revit.DB.ExtensibleStorage.Schema)
Creates a new Entity corresponding to the Schema.
Remarks:
You can store the newly created Entity in an Element or in another Entity.
If you do not have write access to the Schema, an exception will be thrown.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Writing of Entities of this Schema is not allowed to the current add-in.
Since:
2012

Autodesk.Revit.DB.ExtensibleStorage.Entity.#ctor(Autodesk.Revit.DB.ExtensibleStorage.Entity)
Constructs a new copy of the input ESEntity object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012